app/controllers/classifieds_controller.rb

SELECT "classifieds".* FROM "classifieds"
---
#       search_params[:where][:college_id] = college_ids
#     end

    @classifieds = Classified.search(query, search_params)

UPDATE "classifieds" SET "image" = ?, "updated_at" = ? WHERE "classifieds"."id" = 1  [["image", nil], ["updated_at", "2014-06-14 02:16:56.012867"]]
---
  def update
    respond_to do |format|
      if @classified.update(classified_params)

DELETE FROM "classifieds" WHERE "classifieds"."id" = ?  [["id", 1]]
---
  def destroy
    @classified.delete!

SELECT  "classifieds".* FROM "classifieds"  WHERE "classifieds"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_classified
    @classified = Classified.find(params[:id])